[
    {
        "name": "Taj Mahal",
        "location": {
            "city": "Agra",
            "state": "Uttar Pradesh",
            "country": "India",
            "coordinates": {
                "latitude": 27.1751,
                "longitude": 78.0421
            }
        },
        "imageUrl": "",
        "overview": "The Taj Mahal, located on the southern bank of the Yamuna River in Agra, Uttar Pradesh, is one of the most iconic and universally admired masterpieces of the world's heritage. This breathtaking white marble mausoleum was commissioned by the Mughal Emperor Shah Jahan in 1632, in memory of his favorite wife, Mumtaz Mahal, who died during childbirth. The Taj Mahal is not just a symbol of Shah Jahan's eternal love for Mumtaz Mahal but also an embodiment of the grandeur and artistic excellence of the Mughal era.",
        "history": {
            "earlyHistory": "The Taj Mahal was commissioned by Mughal Emperor Shah Jahan in 1632 as a mausoleum for his beloved wife, Mumtaz Mahal. The construction took approximately 21 years, concluding in 1653. This monument was built on the southern bank of the Yamuna River in Agra and reflects the profound love Shah Jahan had for Mumtaz Mahal.",
            "architecturalSignificance": "The Taj Mahal is celebrated for its breathtaking beauty and intricate design. The central dome is 73 meters high and is surrounded by four minarets. The mausoleum is constructed of white marble inlaid with precious stones, featuring elaborate floral patterns and calligraphy. The layout includes a vast garden divided into four parts by waterways, which exemplifies Mughal Garden design.",
            "unescoRecognition": "The Taj Mahal was inscribed as a UNESCO World Heritage Site in 1983. It is recognized for its outstanding universal value as a masterpiece of Mughal architecture and a symbol of eternal love. Its inclusion highlights its historical importance and architectural excellence."
        },
        "visitingHours": {
            "openDays": ["Monday", "Tuesday", "Wednesday", "Thursday", "Saturday", "Sunday"],
            "timings": {
                "from": 6.00,
                "to": 18.30
            }
        },
        "ticketInformation": {
            "indianCitizens": 50,
            "foreignTourists": 1100,
            "saarcBimstecCitizens": 540,
            "childrenBelow15": "Free"
        },
        "howToReach": {
            "nearestAirport": {
                "name": "Agra Airport (Kheria Airport)",
                "distanceKm": 13
            },
            "distanceFrom": 200
        },
        "iframe": "https://www.google.com/maps?q=Taj+Mahal+Dharmapuri+Forest+Colony+Tajganj+Agra+Uttar+Pradesh+India&z=15&output=embed"
    },
    {
        "name": "Agra Fort",
        "location": {
            "city": "Agra",
            "state": "Uttar Pradesh",
            "country": "India",
            "coordinates": {
                "latitude": 27.1795,
                "longitude": 78.0211
            }
        },
        "imageUrl": "",
        "overview": "Agra Fort, a UNESCO World Heritage Site, is a majestic red sandstone fort located on the banks of the Yamuna River in Agra, Uttar Pradesh. Built by Emperor Akbar in 1565, this fort served as the main residence of the Mughal emperors until 1638. The fort is a walled city, housing numerous palaces, halls, and mosques, and offers a fascinating glimpse into the Mughal era's grandeur.",
        "history": {
            "earlyHistory": "Originally built by the Tomar dynasty in the 11th century, Agra Fort was significantly expanded and renovated by the Mughal Emperor Akbar in 1565. The fort served as the main residence of the Mughal emperors until the capital was shifted to Delhi.",
            "architecturalSignificance": "The fort is an exemplary piece of Mughal military architecture, characterized by its massive red sandstone walls, intricate marble palaces, and grand entrance gates. Notable structures within the fort include the Jahangir Palace, Khas Mahal, and the Diwan-i-Khas. The fort's design integrates defensive features with luxurious living spaces, demonstrating Mughal architectural sophistication.",
            "unescoRecognition": "Agra Fort was designated a UNESCO World Heritage Site in 1983. The recognition emphasizes its historical role as a center of Mughal power and its architectural significance, which provides insights into Mughal military and royal life."
        },
        "visitingHours": {
            "openDays": ["All days of the week"],
            "timings": {
                "from": 6.00,
                "to": 18.00
            }
        },
        "ticketInformation": {
            "indianCitizens": 40,
            "foreignTourists": 550,
            "saarcBimstecCitizens": 90,
            "childrenBelow15": "Free"
        },
        "howToReach": {
            "nearestAirport": {
                "name": "Agra Airport",
                "distanceKm": 2.5
            },
            "distanceFrom": 0
        },
        "iframe": "https://www.google.com/maps?q=Agra+Fort+Rakabganj+Agra+Uttar+Pradesh+India&z=15&output=embed"
    },
    {
        "name": "Qutub Minar",
        "location": {
            "city": "Delhi",
            "state": "Delhi",
            "country": "India",
            "coordinates": {
                "latitude": 28.5244,
                "longitude": 77.1855
            }
        },
        "imageUrl": "",
        "overview": "Qutub Minar is a towering minaret in Delhi, standing at a height of 73 meters, making it the tallest brick minaret in the world. It is a UNESCO World Heritage Site and one of Delhi's most popular historical monuments. The minaret is a fine example of Indo-Islamic Afghan architecture, with intricate carvings and verses from the Quran adorning its surface.",
        "history": {
            "earlyHistory": "The Qutub Minar was commissioned by Qutb-ud-din Aibak, the founder of the Delhi Sultanate, in 1193. It was completed by his successor, Iltutmish, in 1368. The minaret was built to celebrate the victory of the Delhi Sultanate over the last Hindu kingdom of Delhi.",
            "architecturalSignificance": "The Qutub Minar stands at 73 meters, making it the tallest brick minaret in the world. It is adorned with intricate carvings and inscriptions in Arabic, and the structure is made of red sandstone with marble and sandstone inlays. The minaret's design reflects early Indo-Islamic architecture, characterized by its fluted cylindrical shape and ornate detailing.",
            "unescoRecognition": "The Qutub Minar was inscribed as a UNESCO World Heritage Site in 1993. It is recognized for its historical significance and architectural brilliance, symbolizing the advent of Islamic rule in India and the development of Indo-Islamic architecture."
        },
        "visitingHours": {
            "openDays": ["All days of the week"],
            "timings": {
                "from": 6.00,
                "to": 18.00
            }
        },
        "ticketInformation": {
            "indianCitizens": 30,
            "foreignTourists": 500,
            "saarcBimstecCitizens": 30,
            "childrenBelow15": "Free"
        },
        "howToReach": {
            "nearestAirport": {
                "name": "Indira Gandhi International Airport",
                "distanceKm": 15
            },
            "distanceFrom": 0
        },
        "iframe": "https://www.google.com/maps?q=Qutub+Minar+Mehrauli+Delhi+India&z=15&output=embed"
    },
    {
        "name": "Humayun's Tomb",
        "location": {
            "city": "Delhi",
            "state": "Delhi",
            "country": "India",
            "coordinates": {
                "latitude": 28.5933,
                "longitude": 77.2507
            }
        },
        "imageUrl": "",
        "overview": "Humayun's Tomb is a stunning Mughal architectural marvel in Delhi, recognized as a UNESCO World Heritage Site. Built in 1570, it was the first garden-tomb on the Indian subcontinent and set a precedent for subsequent Mughal architecture, including the Taj Mahal. The tomb houses the remains of the second Mughal Emperor, Humayun.",
        "history": {
            "earlyHistory": "Humayun's Tomb was commissioned by Empress Bega Begum, the widow of Mughal Emperor Humayun, in 1569. It was designed by Persian architect Mirak Mirza Ghiyas and completed in 1572. The tomb is notable for being the first garden-tomb in India and an early example of Mughal architecture.",
            "architecturalSignificance": "The tomb is constructed from red sandstone and white marble, and it is set within a charbagh (fourfold) garden layout. The design of the tomb, with its central dome and large gardens, influenced subsequent Mughal architecture, including the Taj Mahal. Its symmetrical layout and decorative details reflect the Persian influence on Mughal architecture.",
            "unescoRecognition": "Humayun's Tomb was added to the UNESCO World Heritage list in 1993. It is acknowledged for its architectural innovation and its role as a precursor to the later Mughal mausoleums, demonstrating the evolution of Mughal architectural styles."
        },
        "visitingHours": {
            "openDays": ["All days of the week"],
            "timings": {
                "from": 6,
                "to": 18
            }
        },
        "ticketInformation": {
            "indianCitizens": 40,
            "foreignTourists": 600,
            "saarcBimstecCitizens": 40,
            "childrenBelow15": "Free"
        },
        "howToReach": {
            "nearestAirport": {
                "name": "Indira Gandhi International Airport",
                "distanceKm": 21
            },
            "distanceFrom": 6
        },
        "iframe": "https://www.google.com/maps?q=Humayun's+Tomb+Delhi+India&z=15&output=embed"
    },
    {
        "name": "Sun Temple",
        "location": {
            "city": "Konark",
            "state": "Odisha",
            "country": "India",
            "coordinates": {
                "latitude": 19.8876,
                "longitude": 86.0945
            }
        },
        "imageUrl": "",
        "overview": "The Sun Temple at Konark, also known as the Black Pagoda, is a 13th-century temple dedicated to the Sun God, Surya. It is one of the most renowned temples in India and a UNESCO World Heritage Site. The temple is a brilliant example of ancient Indian architecture, symbolizing the majestic chariot of the Sun God, with twelve pairs of wheels and seven horses.",
        "history": {
            "earlyHistory": "The Sun Temple at Konark was built in the 13th century by King Narasimhadeva I of the Eastern Ganga dynasty. It was constructed to honor the Sun God, Surya, and was part of a grand plan to establish Konark as a major religious and cultural center.",
            "architecturalSignificance": "The temple is renowned for its grand design, which includes a massive stone chariot with 12 pairs of wheels and seven horses. The intricate carvings depict scenes from daily life, mythology, and celestial beings. The temple's architecture is a masterpiece of Kalinga style, reflecting the zenith of Odisha temple architecture.",
            "unescoRecognition": "The Sun Temple was inscribed as a UNESCO World Heritage Site in 1984. The designation recognizes its outstanding architectural features and its role as a significant symbol of Indian cultural heritage and artistic achievement."
        },
        "visitingHours": {
            "openDays": ["All days of the week"],
            "timings": {
                "from": 6,
                "to": 20
            }
        },
        "ticketInformation": {
            "indianCitizens": 30,
            "foreignTourists": 600,
            "saarcBimstecCitizens": 40,
            "childrenBelow15": "Free"
        },
        "howToReach": {
            "nearestAirport": {
                "name": "Biju Patnaik International Airport",
                "distanceKm": 65
            },
            "distanceFrom": 3
        },
        "iframe": "https://www.google.com/maps?q=Sun+Temple+Konark+Odisha+India&z=15&output=embed"
    },
    {
        "name": "Khajuraho Group of Monuments",
        "location": {
            "city": "Khajuraho",
            "state": "Madhya Pradesh",
            "country": "India",
            "coordinates": {
                "latitude": 24.8318,
                "longitude": 79.9191
            }
        },
        "imageUrl": "",
        "overview": "The Khajuraho Group of Monuments is a collection of Hindu and Jain temples in Madhya Pradesh, famous for their intricate carvings and erotic sculptures. Built between 950 and 1050 AD by the Chandela dynasty, these temples are a UNESCO World Heritage Site and represent the pinnacle of Indian temple architecture.",
        "history": {
            "earlyHistory": "The Khajuraho Group of Monuments was built between 950 and 1050 AD by the Chandela dynasty. The temples were dedicated to Hindu and Jain deities and reflect the cultural and religious life of the period.",
            "architecturalSignificance": "The temples are famous for their detailed erotic sculptures and unique architectural style, blending Hindu and Jain elements. The complex includes several temples with richly carved exteriors and intricate interior designs, showcasing the artistic and architectural prowess of the Chandela dynasty.",
            "unescoRecognition": "The Khajuraho Group of Monuments was inscribed as a UNESCO World Heritage Site in 1986. It is recognized for its unique sculptural art and architectural innovation, representing a high point in Indian temple architecture and religious expression."
        },
        "visitingHours": {
            "openDays": ["All days of the week"],
            "timings": {
                "from": 6,
                "to": 18
            }
        },
        "ticketInformation": {
            "indianCitizens": 40,
            "foreignTourists": 600,
            "saarcBimstecCitizens": 40,
            "childrenBelow15": "Free"
        },
        "howToReach": {
            "nearestAirport": {
                "name": "Khajuraho Airport",
                "distanceKm": 5
            },
            "distanceFrom": 0
        },
        "iframe": "https://www.google.com/maps?q=Khajuraho+Group+of+Monuments+Madhya+Pradesh+India&z=15&output=embed"
    },
    {
        "name": "Ajanta and Ellora Caves",
        "location": {
            "city": "Aurangabad",
            "state": "Maharashtra",
            "country": "India",
            "coordinates": {
                "latitude": 20.5524,
                "longitude": 75.7033
            }
        },
        "imageUrl": "",
        "overview": "The Ajanta and Ellora Caves are a group of rock-cut caves near Aurangabad in Maharashtra, known for their remarkable frescoes, sculptures, and ancient Indian art. Ajanta Caves, dating back to the 2nd century BCE, are predominantly Buddhist, while Ellora Caves, built between the 6th and 10th centuries, represent Hindu, Buddhist, and Jain traditions. Both are UNESCO World Heritage Sites.",
        "history": {
            "earlyHistory": "The Ajanta Caves were carved between the 2nd century BCE and the 6th century CE, while the Ellora Caves were created between the 5th and 10th centuries CE. These caves served as monastic retreats and religious centers for Buddhists, Hindus, and Jains.",
            "architecturalSignificance": "Ajanta is known for its vibrant frescoes and intricate sculptures depicting Buddhist themes, while Ellora features a diverse range of cave temples dedicated to Buddhism, Hinduism, and Jainism. The rock-cut architecture of both sites demonstrates advanced engineering and artistic skills.",
            "unescoRecognition": "The Ajanta Caves were inscribed as a UNESCO World Heritage Site in 1983, and the Ellora Caves followed in 1983. Both sites are celebrated for their exceptional art and architectural contributions, reflecting the rich cultural and religious diversity of India."
        },
        "visitingHours": {
            "openDays": ["All days of the week (Ellora Caves closed on Tuesdays)"],
            "timings": {
                "from": 9,
                "to": 17
            }
        },
        "ticketInformation": {
            "indianCitizens": 40,
            "foreignTourists": 600,
            "saarcBimstecCitizens": 40,
            "childrenBelow15": "Free"
        },
        "howToReach": {
            "nearestAirport": {
                "name": "Aurangabad Airport",
                "distanceKm": 35
            },
            "distanceFrom": 4
        },
        "iframe": "https://www.google.com/maps?q=Ajanta+Ellora+Caves+Maharashtra+India&z=15&output=embed"
    },
    {
        "name": "Hampi",
        "location": {
            "city": "Hampi",
            "state": "Karnataka",
            "country": "India",
            "coordinates": {
                "latitude": 15.335,
                "longitude": 76.4606
            }
        },
        "imageUrl": "",
        "overview": "Hampi, the capital of the Vijayanagara Empire in the 14th century, is a UNESCO World Heritage Site known for its stunning ruins and historical significance. Located on the banks of the Tungabhadra River in Karnataka, Hampi is an open museum with over 500 monuments spread across 26 square kilometers.",
        "history": {
            "earlyHistory": "Hampi was established as the capital of the Vijayanagara Empire in the 14th century by Harihara and Bukka Raya I. It flourished as a major cultural and economic hub until its fall in 1565, following the Battle of Talikota.",
            "architecturalSignificance": "The site is renowned for its extensive ruins, including temples, palaces, and market streets. Notable structures include the Virupaksha Temple, the Vithala Temple complex, and the Stone Chariot. The architectural style combines Vijayanagara and Dravidian elements, showcasing the empire's grandeur.",
            "unescoRecognition": "Hampi was added to the UNESCO World Heritage list in 1986. It is recognized for its historical significance and the remarkable preservation of its ancient ruins, which provide insights into the urban planning and cultural achievements of the Vijayanagara Empire."
        },
        "visitingHours": {
            "openDays": ["All days of the week"],
            "timings": {
                "from": 6,
                "to": 18
            }
        },
        "ticketInformation": {
            "indianCitizens": 30,
            "foreignTourists": 500,
            "saarcBimstecCitizens": 30,
            "childrenBelow15": "Free"
        },
        "howToReach": {
            "nearestAirport": {
                "name": "Hubli Airport",
                "distanceKm": 143
            },
            "distanceFrom": 2
        },
        "iframe": "https://www.google.com/maps?q=Hampi+Karnataka+India&z=15&output=embed"
    },
    {
        "name": "Fatehpur Sikri",
        "location": {
            "city": "Fatehpur Sikri",
            "state": "Uttar Pradesh",
            "country": "India",
            "coordinates": {
                "latitude": 27.0942,
                "longitude": 77.6684
            }
        },
        "imageUrl": "",
        "overview": "Fatehpur Sikri is a UNESCO World Heritage Site and a historic city built by Mughal Emperor Akbar in the 16th century. Located near Agra, Uttar Pradesh, the city served as the capital of the Mughal Empire for about 14 years. Fatehpur Sikri is renowned for its stunning Mughal architecture and the fusion of Persian, Indian, and Islamic styles.",
        "history": {
            "earlyHistory": "Fatehpur Sikri was founded by Mughal Emperor Akbar in 1569 as the capital of his empire. The city was abandoned in 1585 due to water shortages and strategic shifts in the empire's administration.",
            "architecturalSignificance": "The city is an exceptional example of Mughal architecture, featuring structures like the Jama Masjid, the Buland Darwaza, and the Diwan-i-Khas. The architecture blends Islamic, Hindu, and Persian styles, reflecting Akbar's policy of religious tolerance and his vision for a grand capital.",
            "unescoRecognition": "Fatehpur Sikri was inscribed as a UNESCO World Heritage Site in 1986. The site is recognized for its architectural innovation, historical significance, and its role as an important political and cultural center during Akbar's reign."
        },
        "visitingHours": {
            "openDays": ["All days of the week"],
            "timings": {
                "from": 6,
                "to": 18
            }
        },
        "ticketInformation": {
            "indianCitizens": 50,
            "foreignTourists": 610,
            "saarcBimstecCitizens": 50,
            "childrenBelow15": "Free"
        },
        "howToReach": {
            "nearestAirport": {
                "name": "Agra Airport",
                "distanceKm": 40
            },
            "distanceFrom": 0
        },
        "iframe": "https://www.google.com/maps?q=Fatehpur+Sikri+Uttar+Pradesh+India&z=15&output=embed"
    },
    {
        "name": "Mahabalipuram",
        "location": {
            "city": "Mahabalipuram",
            "state": "Tamil Nadu",
            "country": "India",
            "coordinates": {
                "latitude": 12.6177,
                "longitude": 80.1954
            }
        },
        "imageUrl": "",
        "overview": "Mahabalipuram, also known as Mamallapuram, is a historic town on the Coromandel Coast of Tamil Nadu, famous for its rock-cut temples and ancient sculptures. Recognized as a UNESCO World Heritage Site, Mahabalipuram was a thriving port city during the Pallava dynasty in the 7th and 8th centuries. The site is renowned for its architectural and artistic achievements, including the Shore Temple and the Pancha Rathas.",
        "history": {
            "earlyHistory": "Mahabalipuram, also known as Mamallapuram, was a thriving port city under the Pallava dynasty during the 7th century. It was established by King Narasimhavarman I and became a major center for trade and religion.",
            "architecturalSignificance": "The site is renowned for its rock-cut temples and monolithic structures, including the Shore Temple and the Pancha Rathas. The architecture represents early Dravidian style with detailed carvings and innovative design, reflecting the Pallavas' artistic and religious expressions.",
            "unescoRecognition": "Mahabalipuram was designated a UNESCO World Heritage Site in 1984. The recognition highlights the site's architectural achievements and its historical role as a significant cultural and religious center in early medieval South India."
        },
        "visitingHours": {
            "openDays": ["All days of the week"],
            "timings": {
                "from": 6,
                "to": 18
            }
        },
        "ticketInformation": {
            "indianCitizens": 40,
            "foreignTourists": 600,
            "saarcBimstecCitizens": 40,
            "childrenBelow15": "Free"
        },
        "howToReach": {
            "nearestAirport": {
                "name": "Chennai International Airport",
                "distanceKm": 60
            },
            "distanceFrom": 2
        },
        "iframe": "https://www.google.com/maps?q=Mahabalipuram+Tamil+Nadu+India&z=15&output=embed"
    }
]